{
  "recipe": {
    "title": "",
    "description": "",
    "prepMin": 10,
    "cookMin": 25,
    "readyMin": 35,
    "servings": 0,
    "footnotes": "",
    "source": "",
    "isPublic": true,
    "directions": [
      {
        "body": ""
      },
      {
        "body": "" 
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }
      
    ],
    "ingredients": [
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      }, 
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      }        
    ]
  }
}
  ///

{
  "recipe": {
    "title": "Roasted Pumpkin Seeds",
    "description": "Here is an easy recipe for roasting fresh pumpkin seeds.",
    "prepMin": 0,
    "cookMin": 0,
    "readyMin": 0,
    "servings": 0,
    "footnotes": "",
    "source": "https://www.allrecipes.com/recipe/13768/roasted-pumpkin-seeds/",
    "isPublic": true,
    "directions": [
      {
        "body": "Preheat oven to 300 degrees F (150 degrees C)."
      },
      {
        "body": "Toss seeds in a bowl with the melted butter and salt. Spread the seeds in a single layer on a baking sheet and bake for about 45 minutes or until golden brown; stir occasionally." 
      }
      
    ],
    "ingredients": [
      {
        "name": "raw whole pumpkin seeds",
        "measure": "1 1/2 cup"
      },
      {
        "name": "butter, melted",
        "measure": "2 tsp"
      },
      {
        "name": "salt",
        "measure": "pinch"
      }
    ]
  }
}
// 

{
  "recipe": {
    "title": "Chicken Pot Pie",
    "description": "A delicious chicken pie made from scratch with carrots, peas and celery.",
    "prepMin": 20,
    "cookMin": 50,
    "readyMin": 70,
    "servings": 0,
    "footnotes": "",
    "source": "https://www.allrecipes.com/recipe/26317/chicken-pot-pie-ix/",
    "isPublic": true,
    "directions": [
      {
        "body": "Preheat oven to 425 degrees F (220 degrees C.)"
      },
      {
        "body": "In a saucepan, combine chicken, carrots, peas, and celery. Add water to cover and boil for 15 minutes. Remove from heat, drain and set aside." 
      }, 
      {
        "body": "In the saucepan over medium heat, cook onions in butter until soft and translucent. Stir in flour, salt, pepper, and celery seed. Slowly stir in chicken broth and milk. Simmer over medium-low heat until thick. Remove from heat and set aside."
      }, 
      {
        "body": "Place the chicken mixture in bottom pie crust. Pour hot liquid mixture over. Cover with top crust, seal edges, and cut away excess dough. Make several small slits in the top to allow steam to escape."
      }, 
      {
        "body": "Bake in the preheated oven for 30 to 35 minutes, or until pastry is golden brown and filling is bubbly. Cool for 10 minutes before serving."
      }
      
    ],
    "ingredients": [
      {
        "name": "skinless, boneless chicken breast halves - cubed",
        "measure": "1 lb"
      },
      {
        "name": "sliced carrots",
        "measure": "1 cup"
      },
      {
        "name": "frozen green peas",
        "measure": "1 cup"
      },
      {
        "name": "sliced celery",
        "measure": "1/2 cup"
      }, 
      {
        "name": "butter",
        "measure": "1/2 cup"
      },
      {
        "name": "chopped onion",
        "measure": "1/3 cup"
      },     
      {
        "name": "all-purpose flour",
        "measure": "1/3 cup"
      },
      {
        "name": "salt",
        "measure": "1/2 tsp"
      },    
      {
        "name": "black pepper",
        "measure": "1/4 tsp"
      },    
      {
        "name": "celery seed",
        "measure": "1/4 tsp"
      },    
      {
        "name": "chicken broth",
        "measure": "1 3/4 cups"
      },    
      {
        "name": "milk",
        "measure": "2/3 cup"
      },
      {
        "name": "unbaked pie crusts",
        "measure": "2 (9 inch)"
      },      
    ]
  }
///

{
  "recipe": {
    "title": "Oven Baked Chicken Strips",
    "description": "Oven Baked Chicken Strips are real food, kid friendly, healthy! And this are Freezer Friendly Meal.",
    "prepMin": 10,
    "cookMin": 25,
    "readyMin": 35,
    "servings": 0,
    "footnotes": "Freezer friendly meal",
    "source": "https://happymoneysaver.com/oven-baked-chicken-strips/",
    "isPublic": true,
    "directions": [
      {
        "body": "Pre-heat oven to 350 degrees."
      },
      {
        "body": "Cut chicken breasts into equal sized strips." 
      }, 
      {
        "body": "Take 3 bowls and in 1 bowl add flour, salt, and pepper. Mix well. In another bowl beat 2 eggs. In third bowl add 1 cup Italian style panko bread crumbs."
      }, 
      {
        "body": "Dip each piece of chicken in flour, then egg, and lastly panko bread crumbs."
      }, 
      {
        "body": "Place chicken strips on a greased or parchment covered baking sheet."
      }, 
      {
        "body": "Bake for 20-25 minutes or until cooked through. Turn Chicken strips halfway through cooking to ensure even cooking and crispiness."
      }, 
      {
        "body": "Serve with ranch, BBQ sauce or your favorite dipping sauce."
      }
      
    ],
    "ingredients": [
      {
        "name": "skinless, boneless chicken breasts",
        "measure": "2 count"
      },
      {
        "name": "flour",
        "measure": "1 cup"
      },
      {
        "name": "salt",
        "measure": "1 tsp"
      },
      {
        "name": "pepper",
        "measure": "1 tsp"
      }, 
      {
        "name": "eggs",
        "measure": "2 count"
      },
      {
        "name": "italian style panko break crumbs",
        "measure": "1 cup"
      }  
    ]
  }
////
{
  "recipe": {
    "title": "Mix-In Muffins",
    "description": "",
    "prepMin": 10,
    "cookMin": 20,
    "readyMin": 30,
    "servings": 12,
    "footnotes": "",
    "source": "",
    "isPublic": true,
    "directions": [
      {
        "body": "Preheat oven to 400 degrees F and line 12 (1/3-cup) muffin cups with paper liners."
      },
      {
        "body": "Into a bowl, sift together flour, sugar, baking powder, baking soda, and salt. Melt butter and in a small bowl whisk together with sour cream, egg, and vanilla. Stir butter mixture (and additional ingredients; *see note, below) into flour mixture until just combined. Divide the batter among muffin cups (this batter is thick and will not run easily like other muffin batters) and bake in middle of oven until golden and a tester comes out clean, about 20 minutes." 
      }, 
      {
        "body": "Becoming a muffin master is easy. *Flavor the basic muffin batter below by adding, for example: 1 chopped banana and 3/4 cup semisweet chocolate chips; or 1 cup toasted almonds, 3/4 cup dried cranberries, and 1/4 teaspoon almond extract; or 1 cup chopped drained canned pineapple and 1 cup sweetened flaked coconut; or 1 cup chopped dried apricots and 1 tablespoon poppy seeds."
      }
    ],
    "ingredients": [
      {
        "name": "all-purpose flour",
        "measure": "1 1/2 cups"
      },
      {
        "name": "sugar",
        "measure": "1/3 cup"
      },
      {
        "name": "baking powder",
        "measure": "1 1/2 tsp"
      },
      {
        "name": "baking soda",
        "measure": "1/4 tsp"
      }, 
      {
        "name": "salt",
        "measure": "1/4 tsp"
      },
      {
        "name": "unsalted butter",
        "measure": "1/2 cup (1 stick)"
      },
      {
        "name": "sour cream",
        "measure": "1 cup"
      },
      {
        "name": "egg",
        "measure": "1 large"
      },
      {
        "name": "vanilla",
        "measure": "1 tsp"
      }        
    ]
  }
  ///
  {
    "recipe": {
      "title": "Asian Ramen Salad",
      "description": "This ridiculously amazing Asian ramen salad will have you and your guests going back for thirds and fourths. Everyone will be asking for the recipe and you'll want to bring this easy dish to every potluck!",
      "prepMin": 130,
      "cookMin": 0,
      "readyMin": 130,
      "servings": 8,
      "footnotes": "",
      "source": "https://www.tablefortwoblog.com/ridiculously-amazing-asian-ramen-salad/",
      "isPublic": true,
      "directions": [
        {
          "body": "In a large bowl, place coleslaw mix, sunflower seeds, sliced almonds, crushed ramen (see note below), and scallions."
        },
        {
          "body": "In a large measuring cup, add vegetable oil, vinegar, and sugar. Whisk together. Don't worry if the sugar will not completely dissolve." 
        }, 
        {
          "body": "Pour oil mixture over the coleslaw mix and toss everything together with a large spatula until everything is coated well."
        }, 
        {
          "body": "Cover bowl with plastic wrap and chill in refrigerator for at least 2 hours."
        }, 
        {
          "body": "Serve cold or room temperature."
        }
        
      ],
      "ingredients": [
        {
          "name": "coleslaw mix",
          "measure": "1 - 16 ounce bag"
        },
        {
          "name": "sunflower seeds",
          "measure": "1 cup"
        },
        {
          "name": "sliced almonds",
          "measure": "1 cup"
        },
        {
          "name": "ramen",
          "measure": "2 - 3 ounce packages"
        }, 
        {
          "name": "scallions, sliced",
          "measure": "5 stalks"
        },
        {
          "name": "vegetable oil",
          "measure": "3/4 cup"
        },
        {
          "name": "white vinegar",
          "measure": "1/3 cup"
        },
        {
          "name": "granulated sugar",
          "measure": "1/2 cup "
        },     
      ]

///
{
  "recipe": {
    "title": "Baked Salmon",
    "description": "Easy Baked Salmon in Foil with Garlic, Lemon, and Herbs. One of the best simple, healthy recipes. Turns out perfectly every time!",
    "prepMin": 15,
    "cookMin": 15,
    "readyMin": 30,
    "servings": 0,
    "footnotes": "This recipe is best enjoyed the day that it is made, as salmon usually dries out when reheated. If you have leftover salmon, try serving it room temperature over a salad the next day or flaking and scrambling it with eggs.",
    "source": "https://www.wellplated.com/baked-salmon-in-foil/",
    "isPublic": true,
    "directions": [
      {
        "body": "Remove the salmon from the refrigerator and let stand at room temperature for 10 minutes while you prepare the other ingredients. Heat oven to 375 degrees F. Line a large baking dish or rimmed baking sheet with a large piece of aluminum foil."
      },
      {
        "body": "Lightly coat the foil with baking spay, then arrange 2 springs of the rosemary down the middle. Cut one of the lemons into thin slices and arrange half the slices down the middle with the rosemary. Place the salmon on top." 
      }, 
      {
        "body": "Drizzle the salmon with the olive oil and sprinkle with the salt and pepper. Rub to coat, then scatter the garlic cloves over the top. Lay the remaining rosemary and lemon slices on top of the salmon. Juice the second lemon, then pour the juice over the top."
      }, 
      {
        "body": "Fold the sides of the aluminum foil up and over the top of the salmon until it is completely enclosed. If your piece of foil is not large enough, place a second piece on top and fold the edges under so that it forms a sealed packet. Leave a little room inside the foil for air to circulate."
      }, 
      {
        "body": "Bake the salmon for 15-20 minutes, until the salmon is almost completely cooked through at the thickest part. The cooking time will vary based on the thickness of your salmon. If your side is thinner (around 1-inch thick) check several minutes early to ensure your salmon does not overcook. If your piece is very thick (1 1/2 inches or more), it may need longer."
      }, 
      {
        "body": "Remove the salmon from the oven and carefully open the foil so that the top of the fish is completely uncovered (be careful of hot steam). Change the oven setting to broil, then return the fish to the oven and broil for 3 minutes, until the top of the salmon and the garlic are slightly golden and the fish is cooked through. Watch the salmon closely as it broils to make sure it doesn’t overcook and the garlic does not burn. Remove the salmon from the oven. If it still appears a bit underdone, you can wrap the foil back over the top and let it rest for a few minutes. Do not let it sit too long—salmon can progress from 'not done' to 'over done' very quickly. As soon as it flakes easily with a fork, it's ready."
      }, 
      {
        "body": "To serve, cut the salmon into portions. Sprinkle with additional fresh herbs or top with an extra squeeze of lemon as desired."
      }, 
      
    ],
    "ingredients": [
      {
        "name": "salmon boneless (skin on or off, depending upon your preference)",
        "measure": "2 lbs"
      },
      {
        "name": "fresh rosemary or fresh herbs of your choice; do not use dried herbs",
        "measure": "5 springs"
      },
      {
        "name": "lemons divided, plus extra for serving as desired",
        "measure": "2 small "
      },
      {
        "name": "extra virgin olive oil",
        "measure": "2 tbsp"
      }, 
      {
        "name": "kosher salt",
        "measure": "1 tsp"
      },
      {
        "name": "ground black pepper",
        "measure": "1/4 tsp"
      },
      {
        "name": "garlic peeled and roughly chopped",
        "measure": "4 cloves"
      },
      {
        "name": "chopped fresh herbs such as basil, thyme, parsley, dill, or green onion (optional)",
        "measure": "additional"
      }
    ]
  }
}    
////
{
  "recipe": {
    "title": "Meatballs",
    "description": "When I get a craving for meatballs, I have a very specific meatball in mind: They’re completely tender all the way through without even a hint of toughness. They’re big enough to require a fork, but modest enough to justify several on the plate. Maybe some onions and fresh herbs mixed in. Nothing fancy. Totally old-school.",
    "prepMin": 0,
    "cookMin": 0,
    "readyMin": 0,
    "servings": 28,
    "footnotes": "Doubling this recipe: This recipe can be doubled for larger crowds. Storing leftover meatballs: Store leftover meatballs, either on their own or in a sauce, in a covered container in the refrigerator for up to 5 days. Reheat over low heat in a saucepan or in the microwave. Make-ahead meatballs: Meatballs can be shaped and kept refrigerated up to a day ahead. Arrange them in a casserole dish or on a baking sheet, but don't squish together. Cover and refrigerate for up to 1 day. Freezing uncooked meatballs: Prepare the meatballs through Step 5. Arrange in a single layer on a baking sheet and freeze until solid. Transfer the meatballs to a freezer container or freezer bag, and freeze for up to 1 month. (Meatballs can be frozen for longer, but tend to develop freezer burn.) Thaw meatballs in the refrigerator overnight before cooking. Freezing cooked meatballs: Let the cooked meatballs cool completely, then arrange in a single layer on baking sheet and freeze until solid. Transfer to a freezer container or bag and freeze for up to 2 months. Frozen meatballs can be thawed overnight in the refrigerator or reheated directly from the freezer. Reheat meatballs in a simmering sauce for 10 to 15 minutes or in a warm oven for 10 to 15 minutes.",
    "source": "https://www.thekitchn.com/how-to-make-meatballs-cooking-lessons-from-the-kitchn-108048",
    "isPublic": true,
    "directions": [
      {
        "body": "Combine the milk and breadcrumbs. Place the breadcrumbs in a small bowl, pour in the milk, and stir to combine. Set aside while preparing the rest of the meatball mixture. The breadcrumbs will absorb the milk and become soggy."
      },
      {
        "body": "Whisk the egg, salt, pepper, Parmesan, and parsley. Whisk the egg in a large bowl until broken up. Add the Parmesan, parsley, salt, and a generous quantity of black pepper, and whisk to combine." 
      }, 
      {
        "body": "Add the ground meat. Add the meat to the egg mixture. Use your hands to thoroughly mix the egg mixture into the ground meat."
      }, 
      {
        "body": "Add the onions and soaked breadcrumbs. Add the onions, garlic, and soaked breadcrumbs. Mix them thoroughly into the meat with your fingers. Try not to overwork the meat; pinch the meat between your fingers rather than kneading it."
      }, 
      {
        "body": "Form the meat into meatballs. Have a rimmed baking sheet ready. Pinch off a piece of the meat mixture and gently roll between your hands to form 1 1/2-inch meatballs (about 2 tablespoons each). Continue shaping until all the meat is used, placing the meatballs on the baking sheet so that they are not touching."
      }, 
      {
        "body": "Option 1: Roast or broil the meatballs in the oven. Broil the meatballs 20 to 25 minutes, or roast at 400°F for 25 to 30 minutes. (Watch closely if making meatballs made with lean meat.) The meatballs are done when cooked through and the outsides are browned, and when they register 165°F in the middle on an instant-read thermometer. Serve immediately."
      }, 
      {
        "body": "Option 2: Cook the meatballs directly in sauce. Bring a marinara or other pasta sauce to a simmer and add as many meatballs as will fit comfortably in the pan. Cover and simmer for 30 to 35 minutes. The meatballs are done when they're cooked through and register 165°F in the middle on an instant-read thermometer. Serve immediately."
      }
      
    ],
    "ingredients": [
      {
        "name": "fine, dry breadcrumbs",
        "measure": "1/2 cup"
      },
      {
        "name": "milk",
        "measure": "1/2 cup"
      },
      {
        "name": "egg",
        "measure": "1 large"
      },
      {
        "name": "grated Parmesan cheese",
        "measure": "1/2 cup"
      }, 
      {
        "name": "finely chopped fresh parsley leaves",
        "measure": "1/4 cup"
      },
      {
        "name": "kosher salt",
        "measure": "2 tsp"
      },
      {
        "name": "Freshly ground black pepper",
        "measure": "to taste"
      },
      {
        "name": "ground meat, such as beef, pork, turkey, chicken, or veal, or a mix",
        "measure": "1 lb"
      },
      {
        "name": "finely chopped onion (or grated on a coarse grater)",
        "measure": "1/2 cup"
      },
      {
        "name": "garlic, minced",
        "measure": "1 clove"
      }         
    ]
  }
}
///{
  "recipe": {
    "title": "",
    "description": "",
    "prepMin": 10,
    "cookMin": 25,
    "readyMin": 35,
    "servings": 0,
    "footnotes": "",
    "source": "",
    "isPublic": true,
    "directions": [
      {
        "body": ""
      },
      {
        "body": "" 
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }, 
      {
        "body": ""
      }
      
    ],
    "ingredients": [
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      }, 
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      },
      {
        "name": "",
        "measure": ""
      }        
    ]
  }
}
  ///

{
  "recipe": {
    "title": "Roasted Pumpkin Seeds",
    "description": "Here is an easy recipe for roasting fresh pumpkin seeds.",
    "prepMin": 0,
    "cookMin": 0,
    "readyMin": 0,
    "servings": 0,
    "footnotes": "",
    "source": "https://www.allrecipes.com/recipe/13768/roasted-pumpkin-seeds/",
    "isPublic": true,
    "directions": [
      {
        "body": "Preheat oven to 300 degrees F (150 degrees C)."
      },
      {
        "body": "Toss seeds in a bowl with the melted butter and salt. Spread the seeds in a single layer on a baking sheet and bake for about 45 minutes or until golden brown; stir occasionally." 
      }
      
    ],
    "ingredients": [
      {
        "name": "raw whole pumpkin seeds",
        "measure": "1 1/2 cup"
      },
      {
        "name": "butter, melted",
        "measure": "2 tsp"
      },
      {
        "name": "salt",
        "measure": "pinch"
      }
    ]
  }
}
///
{
  "recipe": {
    "title": "Beef Enchiladas Rancheras",
    "description": "A baked dish of browned ground beef, tomatoes and enchilada sauce wrapped in corn tortillas then topped with more enchilada sauce and cheese",
    "prepMin": 15,
    "cookMin": 30,
    "readyMin": 45,
    "servings": 6,
    "footnotes": "https://www.readyseteat.com/recipes-Beef-Enchiladas-Rancheras-3333",
    "source": "",
    "isPublic": true,
    "directions": [
      {
        "body": "Preheat oven to 375°F. Spray 13x9-inch baking dish with cooking spray."
      },
      {
        "body": "Cook beef in large skillet over medium heat 7 minutes or until meat crumbles and is no longer pink; drain. Add drained tomatoes and 1 cup enchilada sauce; blend well." 
      }, 
      {
        "body": "Place tortillas in damp paper towels; microwave on HIGH 1 minute or just until flexible. Place about 1/3 cup beef mixture evenly on each tortilla. Top each with about 1 tablespoon cheese. Roll up and place seam side down in baking dish. Top with remaining sauce and remaining 1 cup cheese, spreading evenly and covering tortilla edges."
      }, 
      {
        "body": "Bake covered 30 minutes. Serve with a dollop of sour cream, if desired."
      }
    ],
    "ingredients": [
      {
        "name": "ground sirloin beef (90% lean)",
        "measure": "1 lb"
      },
      {
        "name": "RoTel Original Diced Tomatoes & Green Chilies, drained",
        "measure": "1 can (10 oz each)"
      },
      {
        "name": "Rosarita Enchilada Sauce",
        "measure": "1 can (29 oz each)"
      },
      {
        "name": "corn tortillas (6 inch)",
        "measure": "12"
      }, 
      {
        "name": "shredded Cheddar and Monterey Jack cheese blend",
        "measure": "2 cups"
      },
      {
        "name": "sour cream",
        "measure": "optional"
      }
    ]
  }
}